단백질끼리 상호작용할때 어떻게 될까?
(도킹)

1. 단백질끼리의 상호작용 2. 물에대한 고려 두가지가 필요하다.

hydrophobic interaction: 물들이 polarity가 낮은 sidechain을 가진 아미노산끼리 뭉친다.

대부분의 단백질 복합체는 일시적으로 결합하기에 약하고 이를 실험적으로 결정하기가 어렵다.

이런건 치료용 항체 설계, 단백질 상호작용 저해제 설계에도 사용된다.

종류: homo-oligoimer(같은 단백질이 모임) / hetero-oligomer(서로 다른 단백질이 모임)

접근법: Ab initio 도킹 : 이렇게도 붙여보고 저렇게도 붙이면서 가장 안정한 구조가 뭘까
--> 어떻게 샘플링하고 점수를 어떻게 설계할것인가

/ 주형 기반 도킹(template based docking) : 비슷한 복합체를 찾아서 template으로 사용하자
--> template이 좋은지 나쁜지 어떻게 정하고 데이터베이스에서 어떻게 찾을건가

GalaxyTongDock: 강체 도킹 방법
붙을 수 있는 경우의 수가 너무 많아서 강체로 취급한다.


